# Implemenation Deep Learning for Dataset Titanic

In [0]:
#Some librarys
import numpy as np
import pandas as pd

### Mount My Drive

In [4]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

###  Colleting Data

In [6]:
X_train = pd.read_csv(r'/content/drive/My Drive/Titanic/train.csv')
X_test = pd.read_csv(r'/content/drive/My Drive/Titanic/test.csv')
X_train.head(5)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

### Data Wrabling

In [7]:
# Delete some columns that is not concerned
def drop_not_concerned_columns(data, columns):
    return data.drop(columns, axis=1)

columns = ['PassengerId', 'Name', 'Ticket', 'Fare', 'Cabin', 'Embarked']
X_train = drop_not_concerned_columns(X_train, columns)
X_test = drop_not_concerned_columns(X_test, columns)
X_train.head(5)

   Survived  Pclass     Sex   Age  SibSp  Parch
0         0       3    male  22.0      1      0
1         1       1  female  38.0      1      0
2         1       3  female  26.0      0      0
3         1       1  female  35.0      1      0
4         0       3    male  35.0      0      0

In [8]:
nan_columns = ['Age', 'SibSp', 'Parch']
print(len(X_train))
X_train = X_train.dropna()
X_test = X_test.dropna()
print(len(X_train))

891
714

In [9]:
#normalize 
def dummy_data(data, columns):
    for column in columns:
        data = pd.concat([data, pd.get_dummies(data[column], prefix=column)], axis=1)
        data = data.drop(column, axis=1)
        
    return data

dum_columns = ['Pclass']
X_train = dummy_data(X_train, dum_columns)
X_test = dummy_data(X_test, dum_columns)
X_train.head(5)

   Survived     Sex   Age  SibSp  Parch  Pclass_1  Pclass_2  Pclass_3
0         0    male  22.0      1      0         0         0         1
1         1  female  38.0      1      0         1         0         0
2         1  female  26.0      0      0         0         0         1
3         1  female  35.0      1      0         1         0         0
4         0    male  35.0      0      0         0         0         1

### Pre-processing